app/controllers/workouts_controller.rb

  def index
    @workouts = Workout.where(user_id: @user.id)
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = $1  [["user_id", 1]]

  def create
    @workout = Workout.new(workout_params)
    @workout.user_id = @user.id

    if @workout.save
---
INSERT INTO "workouts" ("date", "title", "time", "sport", "description", "distance", "exertion", "url", "isFavorite", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    if @workout.update(workout_params)
---
UPDATE "workouts" SET "title" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["title", "Workout 2.1"], ["updated_at", "2020-11-19 17:41:38.620363"], ["id", 2]]

    def set_workout
      @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]